import sqlite3

data_base = 'accounting_app.db'
conn_db = sqlite3.connect(data_base)

conn_db.cursor().execute('''
    CREATE TABLE IF NOT EXISTS contragents
    (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        company TEXT,
        bulstat INTEGER,
        vat_number TEXT,
        ndr_number TEXT,
        iln_number TEXT,
        phone_number INTEGER,
        city text,
        registration_address TEXT,
        current_address TEXT,
        personincharge TEXT,
        persontoreceive TEXT,
        country TEXT,
        region TEXT
    );
''')
conn_db.commit()

conn_db.cursor().execute('''
    CREATE TABLE IF NOT EXISTS accounts
    (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        accountnumber INTEGER,
        accountname TEXT,
        debit1 DOUBLE,
        credit1 DOUBLE,
        debit2 DOUBLE,
        credit2 DOUBLE,
        debit3 DOUBLE,
        credit3 DOUBLE,
        accumulateddebit DOUBLE,
        accumulatedcredit DOUBLE
    );
''')
conn_db.commit()

list_of_accounts = [(101, 'Основен капитал, изискващ регистрация', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (102, 'Капитал неизискващ регистрация (за консорциуми и дружества по ЗЗД)', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (103, 'Ликвидационен капитал при несъстоятелност и ликвидация', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (104, 'Капитал на предприятия с нестопанска дейност', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (121, 'Непокрита загуба от минали години', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (122, 'Неразпределена печалба от минали години', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (123, 'Печалби и загуби от текущата година', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (124, 'Резултат при несъстоятелност и ликвидация', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (125, 'Резултат от дейността на предприятия с нестопанска цел', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (151, 'Получени краткосрочни заеми', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (152, 'Получени дългосрочни заеми', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (153, 'Кредитни карти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (154, 'Дългови инструменти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (159, 'Други заеми и дългове', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (2011, 'Земи (Терени)', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (2012, 'Подобрения върху земите', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (202, 'Сгради и конструкции', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (203, 'Компютърна техника', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (204, 'Съоръжения', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (205, 'Машини и оборудване', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (206, 'Транспортни средства', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (207, 'Офис обзавеждане', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (209, 'Други дълготрайни материални активи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (401, 'Задължения към доставчици', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (402, 'Вземания от доставчици по аванси', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (403, 'Задължения към доставчици по търговски кредити', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (404, 'Задължения към доставчици по доставки при определени условия', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (405, 'Задължения към доставчици свързани лица', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (409, 'Други задължения към доставчици', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (411, 'Вземания от клиенти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (412, 'Задължения към клиенти по аванси', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (413, 'Вземания от клиенти по търговски кредити', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (414, 'Вземания от клиенти по продажби при определени условия', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (415, 'Вземания от клиенти свързани лица', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (419, 'Други вземания от клиенти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (4531, 'Начислен данък върху добавената стойност за покупките', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (4532, 'Начислен данък върху добавената стойност за продажбите', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (4536, 'Отложен данъчен кредит', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (4537, 'Неизползван данъчен кредит', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (4538, 'Данък върху добавената стойност за възстановяване', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (4539, 'Данък върху добавената стойност за внасяне', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (501, 'Каса в левове', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (502, 'Каса във валута', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (503, 'Разплащателна сметки в левове', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (504, 'Разплащателна сметка във валута', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (505, 'Акредитиви', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (506, 'Предоставени депозити', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (507, 'Парични средства, заложени като обезпечение', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (509, 'Други парични средства (в т.ч. ваучери и чекове)', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (511, 'Финансови активи, отчитани по справедлива стойност в печалбата или загубата', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (512, 'Финансови активи, държани до настъпване на падеж', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (513, 'Краткосрочни заеми и вземания', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (514, 'Финансови активи на разположение за продажба', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (519, 'Други краткосрочни финансови активи (в т.ч. благородни метали)', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (601, 'Разходи за материали', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (602, 'Разходи за външни услуги', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (603, 'Разходи за амортизация', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (604, 'Разходи за заплати (възнаграждения)', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (605, 'Разходи за осигуровки', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (606, 'Разходи за данъци, такси и други подобни плащания', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (607, 'Разходи за провизии', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (608, 'Разходи от последващи оценки на активи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (609, 'Други разходи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (611, 'Разходи за основна дейност', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (612, 'Разходи за спомагателна дейност', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (613, 'Разходи за придобиване на дълготрайни активи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (614, 'Административни разходи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (615, 'Разходи за продажби', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (621, 'Разходи за лихви', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (623, 'Разходи по операции с финансови активи и инструменти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (624, 'Разходи по валутни операции', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (625, 'Разходи от последващи оценки на финансови активи и инструменти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (629, 'Други финансови разходи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (651, 'Нефинансови разходи за бъдещи периоди', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (652, 'Финансови разходи за бъдещи периоди', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (691, 'Извънредни разходи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (701, 'Приходи от продажби на продукти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (702, 'Приходи от продажби на стоки', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (703, 'Приходи от продажби на услуги', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (704, 'Приходи от наеми', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (705, 'Приходи от продажби на дълготрайни активи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (706, 'Приходи от продажба на суровини/материали', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (707, 'Приходи от последваща оценка на активи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (708, 'Приходи от финансирания', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (709, 'Други приходи от дейността', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (721, 'Приходи от лихви', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (722, 'Приходи от съучастия', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (723, 'Приходи от операции с финансови активи и инструменти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (724, 'Приходи от валутни операции', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (725, 'Приходи от последващи оценки на финансови активи и инструменти', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (729, 'Други финансови приходи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (751, 'Нефинансови приходи за бъдещи периоди', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (752, 'Финансови приходи за бъдещи периоди', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (753, 'Финансиране за дълготрайни активи', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00),
                    (754, 'Финансиране на текущата дейност', 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00)]

# print(list_of_accounts[0])
display_data = conn_db.cursor()
display_data.execute('SELECT * FROM accounts')
retrieve_data = display_data.fetchall()
# print(retrieve_data)
if not retrieve_data:
    for row, item, debit1, credit1, debit2, credit2, debit3, credit3, accdebit, acccredit, in list_of_accounts:
        conn_db.execute('INSERT INTO accounts(accountnumber, accountname, debit1, credit1, debit2, credit2, debit3, credit3, accumulateddebit, accumulatedcredit) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)', (row, item, debit1, credit1, debit2, credit2, debit3, credit3, accdebit, acccredit))
        conn_db.commit()
else:
    pass

conn_db.cursor().execute('''
    CREATE TABLE IF NOT EXISTS inserteddocs
    (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        documentstype TEXT,
        documentsnumber INTEGER,
        documentsdate TEXT,
        sum DOUBLE,
        VAT DOUBLE,
        total DOUBLE
    );
''')
conn_db.commit()
